kAMDSuccess = "没有出现错误。";
kAMDUndefinedError = "发生未知错误。";
kAMDBadHeaderError = "无法传输文件。";
kAMDNoResourcesError = "无法分配资源。";
kAMDReadError = "无法读取设备信息。";
kAMDWriteError = "无法写入设备。";
kAMDUnknownPacketError = "数据包未知。";
kAMDInvalidArgumentError = "参数无效。";
kAMDNotFoundError = "找不到该文件。";
kAMDIsDirectoryError = "路径是目录。";
kAMDPermissionError = "您没有权限。";
kAMDNotConnectedError = "未连接到设备。";
kAMDTimeOutError = "操作超时。";
kAMDOverrunError = "出现缓冲过载。";
kAMDEOFError = "文件结尾。";
kAMDUnsupportedError = "不支持此操作。";
kAMDFileExistsError = "文件已存在。";
kAMDBusyError = "设备正忙。";
kAMDCryptoError = "无法建立与设备的安全连接。";
kAMDTooBigError = "信息太大。";
kAMDInvalidResponseError = "已收到设备上的意外响应。";
kAMDMissingKeyError = "缺少密钥。";
kAMDMissingValueError = "缺少值。";
kAMDGetProhibitedError = "无法从密码锁定的设备上获取值。";
kAMDSetProhibitedError = "无法在设备上设置值。";
kAMDRemoveProhibitedError = "无法移除设备上的值。";
kAMDImmutableValueError = "无法更改此值。";
kAMDPasswordProtectedError = "设备已被密码保护。";
kAMDMissingHostIDError = "设备没有识别该主机。";
kAMDInvalidHostIDError = "设备没有识别该主机。";
kAMDSessionActiveError = "会话处于活跃状态。";
kAMDSessionInactiveError = "会话处于不活跃状态。";
kAMDMissingSessionIDError = "缺少会话 ID。";
kAMDInvalidSessionIDError = "会话 ID 无效。";
kAMDMissingServiceError = "缺少服务。";
kAMDInvalidServiceError = "服务无效。";
kAMDServiceLimitError = "已在太多情形下运行此服务。";
kAMDCheckinSetupFailedError = "无法在设备上启动服务";
kAMDInvalidCheckinError = "无法在设备上启动服务";
kAMDCheckinTimeoutError = "无法在设备上正常启动该服务。";
kAMDCheckinConnectionFailedError = "无法在设备上正常启动该服务。";
kAMDCheckinReceiveFailedError = "无法在设备上正常启动该服务。";
kAMDCheckinResponseFailedError = "无法在设备上正常启动该服务。";
kAMDCheckinOutOfMemoryError = "无法在设备上正常启动该服务。";
kAMDCheckinSendFailedError = "无法在设备上正常启动该服务。";
kAMDMissingPairRecordError = "主机未与设备配对。";
kAMDInvalidPairRecordError = "主机不再与设备配对。";
kAMDSavePairRecordFailedError = "无法存储配对记录。";
kAMDInvalidActivationRecordError = "激活记录无效。";
kAMDMissingActivationRecordError = "找不到激活记录。";
kAMDServiceProhibitedError = "无法在设备上启动该服务。";
kAMDEscrowLockedError = "设备在启动并首次解锁之后才可使用。";
kAMDProhibitedBySupervision = "禁止在被监督的设备上操作。";
kAMDPairingProhibitedError = "只允许通过 USB 配对。";
kAMDWrongDroidError = "设备处于恢复模式中。";
kAMDSUVerificationError = "无法验证软件更新包。";
kAMDSUPatchError = "无法修补文件。";
kAMDSUFirmwareError = "无法刷写固件。";
kAMDProvisioningProfileNotValid = "预置描述文件无效。";
kAMDSendMessageError = "无法将信息发送到设备上。";
kAMDReceiveMessageError = "无法接收设备上的信息。";
kAMDMissingOptionsError = "缺少选项。";
kAMDMissingImageTypeError = "缺少图像。";
kAMDDigestFailedError = "无法读取磁盘映像。";
kAMDStartServiceError = "无法启动该服务。";
kAMDInvalidDiskImageError = "磁盘映像无效。";
kAMDMissingDigestError = "缺少摘要。";
kAMDMuxError = "USB 多路转接器出错。";
kAMDApplicationAlreadyInstalledError = "带给定的包识别符的系统应用程序已安装在设备上，不可替换。";
kAMDApplicationMoveFailedError = "无法将应用程序移到设备上。";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "无法在沙盒中运行应用程序。";
kAMDApplicationVerificationFailedError = "无法验证应用程序。";
kAMDArchiveDestructionFailedError = "无法移除应用程序的归档。";
kAMDBundleVerificationFailedError = "无法验证营运商软件包。";
kAMDCarrierBundleCopyFailedError = "无法安装营运商软件包。";
kAMDCarrierBundleDirectoryCreationFailedError = "无法创建营运商软件包目录。";
kAMDCarrierBundleMissingSupportedSIMsError = "没有此营运商软件包支持的 SIM 卡。";
kAMDCommCenterNotificationFailedError = "无法听取基带的通知。";
kAMDContainerCreationFailedError = "无法创建应用程序的容器。";
kAMDContainerP0wnFailedError = "无法修复应用程序的容器上的权限。";
kAMDContainerRemovalFailedError = "无法移除应用程序的容器。";
kAMDEmbeddedProfileInstallFailedError = "无法安装嵌入式预置描述文件。";
kAMDErrorError = "发生错误。";
kAMDExecutableTwiddleFailedError = "无法更改应用程序上的可执行权限。";
kAMDExistenceCheckFailedError = "无法查看应用程序是否已存在。";
kAMDInstallMapUpdateFailedError = "无法更新已安装的应用程序列表。";
kAMDManifestCaptureFailedError = "无法存储应用程序清单。";
kAMDMapGenerationFailedError = "无法生成应用程序列表。";
kAMDMissingBundleExecutableError = "应用程序包不包含可执行文件。";
kAMDMissingBundleIdentifierError = "应用程序包不包含有效的标识符。";
kAMDMissingBundlePathError = "无法确定应用程序包路径。";
kAMDMissingContainerError = "找不到已安装应用程序的容器。";
kAMDNotificationFailedError = "无法发布通知。";
kAMDPackageExtractionFailedError = "无法打开应用程序包。";
kAMDPackageInspectionFailedError = "无法检查应用程序包。";
kAMDPackageMoveFailedError = "无法将应用程序包移到暂存位置。";
kAMDPathConversionFailedError = "无法转换路径。";
kAMDRestoreContainerFailedError = "无法恢复应用程序的容器。";
kAMDSeatbeltProfileRemovalFailedError = "无法移除应用程序的安全带描述文件。";
kAMDStageCreationFailedError = "无法创建暂存目录。";
kAMDSymlinkFailedError = "无法创建链接。";
kAMDiTunesArtworkCaptureFailedError = "无法存储 iTunes 插图。";
kAMDiTunesMetadataCaptureFailedError = "无法存储 iTunes 元数据。";
kAMDAlreadyArchivedError = "应用程序已归档。";
kAMDUnknownCommandError = "设备没有识别该命令。";
kAMDAPIInternalError = "内部 API 出错。";
kAMDMuxCreateListenerError = "无法听取 USB 设备的信息。";
kAMDMuxGetListenerError = "无法取得 USB 监听器。";
kAMDMuxConnectError = "无法连接到设备。";
kAMDDeviceTooNewError = "需要更新此应用程序。";
kAMDDeviceRefNoGood = "此设备已不再连接。";
kAMDDeviceDisconnectedError = "此设备已不再连接。";
kAMDCannotTranslateError = "无法翻译设备上的信息";
kAMDMobileImageMounterMissingImageSignature = "无法支持开发。";
kAMDMobileImageMounterResponseCreationFailed = "无法支持开发。";
kAMDMobileImageMounterMissingImageType = "无法支持开发。";
kAMDMobileImageMounterMissingImagePath = "无法支持开发。";
kAMDMobileImageMounterImageMapLoadFailed = "无法支持开发。";
kAMDMobileImageMounterAlreadyMounted = "无法支持开发。";
kAMDMobileImageMounterImageMoveFailed = "无法支持开发。";
kAMDMobileImageMounterMountPathMissing = "无法支持开发。";
kAMDMobileImageMounterMountPathNotEmpty = "无法支持开发。";
kAMDMobileImageMounterImageMountFailed = "无法支持开发。";
kAMDMobileImageMounterTrustCacheLoadFailed = "无法支持开发。";
kAMDMobileImageMounterDigestFailed = "无法支持开发。";
kAMDMobileImageMounterDigestCreationFailed = "无法支持开发。";
kAMDMobileImageMounterImageVerificationFailed = "无法支持开发。";
kAMDMobileImageMounterImageInfoCreationFailed = "无法支持开发。";
kAMDMobileImageMounterImageMapStoreFailed = "无法支持开发。";
kAMDDeviceOSVersionTooLow = "设备的 OS 版本太低。";
kAMDNoWifiSyncSupportError = "设备不支持无线同步。";
kAMDDeviceFamilyNotSupported = "此应用程序不支持此类设备。";
kAMDPackagePatchFailedError = "无法对应用程序应用修补更新。";
kAMDIncorrectArchitectureError = "此应用程序不支持此设备的 CPU 类型。";
kAMDPluginCopyFailedError = "无法将“VPN 插件”拷贝进应用程序的容器。";
kAMDBreadcrumbFailedError = "无法更新写入面包屑 (breadcrumb)。";
kAMDBreadcrumbUnlockError = "无法更新安装面包屑 (breadcrumb)。";
kAMDGeoJSONCaptureFailedError = "无法存储 GeoJSON 数据。";
kAMDNewsstandArtworkCaptureFailedError = "无法存储“报刊杂志”插图。";
kAMDMissingCommandError = "该请求未包含命令。";
kAMDNotEntitledError = "正在请求的应用程序不允许进行此请求。";
kAMDMissingPackagePathError = "请求缺少包路径。";
kAMDMissingContainerPathError = "请求缺少容器路径。";
kAMDMissingApplicationIdentifierError = "请求缺少应用程序标识符。";
kAMDMissingAttributeValueError = "请求缺少必需的值。";
kAMDLookupFailedError = "无法列出已安装的应用程序。";
kAMDDictCreationFailedError = "无法从该请求提取功能。";

/* kMISFileError */
"A file operation failed." = "文件操作失败。";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "已添加、修改或删除签名的资源。";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "找不到此可执行文件的有效描述文件。";

/* kMISUnknownError */
"An unknown error has occurred." = "发生未知错误。";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "已尝试修改不可变的描述文件。";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "此应用程序没有有效的签名。";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "应用程序的签名有效但与期望的哈希值不符。";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "可执行文件包含无效的签名。";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "可执行文件已使用无效的权利签名。";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "用于给可执行文件签名的身份不再有效。";

/* kMISSignatureNotValidError */
"The signature was not valid." = "签名无效。";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "与设备通信时发生错误。";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "此描述文件不能在此设备上安装。";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "此描述文件没有有效的签名（或签名有效但不被信任）。";

/* kMISExpiredError */
"This provisioning profile has expired." = "此描述文件已过期。";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "此描述文件不正确。";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "不支持此描述文件。";

/* kMISAllocationError */
"Unable to allocate memory." = "无法分配内存。";

